const memories = [

    {
        id: 1,

        date: "21/12/2025",

        title: "خروجة مول العرب Z&B ❤️",

        folder: "خروجة مول العرب Z&B",

        startImage: 1,

        endImage: 23,

        extension: "jpeg",

        commentBefore:
            "  اول واحلي خروجه لينا حقيقي كان من احلي وامتع واكيت الايام في حياتي حتي بصي ع الصور كده 😂❤️",

        commentAfter:
            "حرفيا بنتي وصحبتي وكل حاجه في حياتي ومراتي ان شاء الله كنت ابغا بوسه جدا وانتي في حضني عمتا بقا😂❤️"
    },


    {
        id: 2,

        date: "6/10/2025",

        title: "قلعة صلاح الدين ❤️",

        folder: "قلعة صلاح الدين",

        startImage: 1,

        endImage: 34,

        extension: "jpeg",

        commentBefore:
            "ده بقا يوم حرفيا منبهر بي حلاوتك بس يوم حرفيا مش شايف قدامي غيرك حرفيا بحبك بقا❤️",

        commentAfter:
            "في اخر اليوم ده بقا كان فيه شوية غيره ثغننين بس انا  برضو بعشقك 😂❤️"
    },


    {
        id: 3,

        date: "كل العبثيات في كل الاوقات ❤️",

        title: "عبثيات بالكاميرا ❤️",

        folder: "عبثيات بالكاميرا",

        startImage: 1,

        endImage: 42,

        extension: "jpeg",

        commentBefore:
            " دي بقا عبثياتنا كلها تقريبا كان نفسي في بوسه وتبقي من ضمن العبثيات 😁❤️",

        commentAfter:
            "مفيش في دماغي غير اني بحبك حاليا بقا 😂❤️"
    },


    {
        id: 4,

        date: "20/1/2026",

        title: "عيد ميلاد بسبوسه ال19 ❤️",

        folder: "عيد ميلاد بسبوسه ال19",

        startImage: 1,

        endImage: 35,

        extension: "jpeg",

        commentBefore:
            "حرفيا ده يوم كان نفسي اجبلك فيه نجمه من لسما مش بس ورد يوم حرفيا في قلبي زيك بظبط ي قلبي 😂❤️",

        commentAfter:
            "يوم مكنتش عاوزه يخلص حرفيا بس ان شاء الله اللي جاي هبهرك 😂❤️"
    },


    {
        id: 5,

        date: "2/3/2026",

        title: "كياته في الاتوبيس ❤️",

        folder: "كياته في الاتوبيس",

        startImage: 1,

        endImage: 7,

        extension: "jpeg",

        commentBefore:
            "دي حرفيا شوية حلويات في صور 😍❤️",

        commentAfter:
            "عمتا بقا بموووووووووووووووووووووووت فيكي 😂❤️"
    },


    {
        id: 6,

        date: "19/3/2026",

        title: "يوم في الجامعه لوحدنا ❤️",

        folder: "يوم في الجامعه لوحدنا",

        startImage: 1,

        endImage: 14,

        extension: "jpeg",

        commentBefore:
            "حرفيا يوم عنوانه الرئيسي بسوسه هي اماني ❤️",

        commentAfter:
            "️ربنا يديمك ليا ويديمك تاج فوق راسي ي قلبي وعنيا ❤️"
    }

];